MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB206/mcu.h
#define _IPC18_LVDIP2_POSITION                   0x00000002
#define _IPC18_LVDIP2_MASK                       0x00000004
#define _IPC18_LVDIP2_LENGTH                     0x00000001

#define _IPC19_CTMUIP_POSITION                   0x00000004
#define _IPC19_CTMUIP_MASK                       0x00000070
#define _IPC19_CTMUIP_LENGTH                     0x00000003

#define _IPC19_CTMUIP0_POSITION                  0x00000004
#define _IPC19_CTMUIP0_MASK                      0x00000010
#define _IPC19_CTMUIP0_LENGTH                    0x00000001

#define _IPC19_CTMUIP1_POSITION                  0x00000005
#define _IPC19_CTMUIP1_MASK                      0x00000020
#define _IPC19_CTMUIP1_LENGTH                    0x00000001

#define _IPC19_CTMUIP2_POSITION                  0x00000006
#define _IPC19_CTMUIP2_MASK                      0x00000040
#define _IPC19_CTMUIP2_LENGTH                    0x00000001

#define _IPC20_U3ERIP_POSITION                   0x00000004
#define _IPC20_U3ERIP_MASK                       0x00000070
#define _IPC20_U3ERIP_LENGTH                     0x00000003

#define _IPC20_U3RXIP_POSITION                   0x00000008
#define _IPC20_U3RXIP_MASK                       0x00000700
#define _IPC20_U3RXIP_LENGTH                     0x00000003

#define _IPC20_U3TXIP_POSITION                   0x0000000C
#define _IPC20_U3TXIP_MASK                       0x00007000
#define _IPC20_U3TXIP_LENGTH                     0x00000003

#define _IPC20_U3ERIP0_POSITION                  0x00000004
#define _IPC20_U3ERIP0_MASK                      0x00000010
#define _IPC20_U3ERIP0_LENGTH                    0x00000001

#define _IPC20_U3ERIP1_POSITION                  0x00000005
#define _IPC20_U3ERIP1_MASK                      0x00000020
#define _IPC20_U3ERIP1_LENGTH                    0x00000001

#define _IPC20_U3ERIP2_POSITION                  0x00000006
#define _IPC20_U3ERIP2_MASK                      0x00000040
#define _IPC20_U3ERIP2_LENGTH                    0x00000001

#define _IPC20_U3RXIP0_POSITION                  0x00000008
#define _IPC20_U3RXIP0_MASK                      0x00000100
#define _IPC20_U3RXIP0_LENGTH                    0x00000001

#define _IPC20_U3RXIP1_POSITION                  0x00000009
#define _IPC20_U3RXIP1_MASK                      0x00000200
#define _IPC20_U3RXIP1_LENGTH                    0x00000001

#define _IPC20_U3RXIP2_POSITION                  0x0000000A
#define _IPC20_U3RXIP2_MASK                      0x00000400
#define _IPC20_U3RXIP2_LENGTH                    0x00000001

#define _IPC20_U3TXIP0_POSITION                  0x0000000C
#define _IPC20_U3TXIP0_MASK                      0x00001000
#define _IPC20_U3TXIP0_LENGTH                    0x00000001

#define _IPC20_U3TXIP1_POSITION                  0x0000000D
#define _IPC20_U3TXIP1_MASK                      0x00002000
#define _IPC20_U3TXIP1_LENGTH                    0x00000001

#define _IPC20_U3TXIP2_POSITION                  0x0000000E
#define _IPC20_U3TXIP2_MASK                      0x00004000
#define _IPC20_U3TXIP2_LENGTH                    0x00000001

#define _IPC21_SI2C3IP_POSITION                  0x00000000
#define _IPC21_SI2C3IP_MASK                      0x00000007
#define _IPC21_SI2C3IP_LENGTH                    0x00000003

#define _IPC21_MI2C3IP_POSITION                  0x00000004
#define _IPC21_MI2C3IP_MASK                      0x00000070
#define _IPC21_MI2C3IP_LENGTH                    0x00000003

#define _IPC21_USB1IP_POSITION                   0x00000008
#define _IPC21_USB1IP_MASK                       0x00000700
#define _IPC21_USB1IP_LENGTH                     0x00000003

#define _IPC21_U4ERIP_POSITION                   0x0000000C
#define _IPC21_U4ERIP_MASK                       0x00007000
#define _IPC21_U4ERIP_LENGTH                     0x00000003

#define _IPC21_SI2C3IP0_POSITION                 0x00000000
#define _IPC21_SI2C3IP0_MASK                     0x00000001
#define _IPC21_SI2C3IP0_LENGTH                   0x00000001

#define _IPC21_SI2C3IP1_POSITION                 0x00000001
#define _IPC21_SI2C3IP1_MASK                     0x00000002
#define _IPC21_SI2C3IP1_LENGTH                   0x00000001

#define _IPC21_SI2C3IP2_POSITION                 0x00000002
#define _IPC21_SI2C3IP2_MASK                     0x00000004
#define _IPC21_SI2C3IP2_LENGTH                   0x00000001

#define _IPC21_MI2C3IP0_POSITION                 0x00000004
#define _IPC21_MI2C3IP0_MASK                     0x00000010
#define _IPC21_MI2C3IP0_LENGTH                   0x00000001

#define _IPC21_MI2C3IP1_POSITION                 0x00000005
#define _IPC21_MI2C3IP1_MASK                     0x00000020
#define _IPC21_MI2C3IP1_LENGTH                   0x00000001

#define _IPC21_MI2C3IP2_POSITION                 0x00000006
#define _IPC21_MI2C3IP2_MASK                     0x00000040
#define _IPC21_MI2C3IP2_LENGTH                   0x00000001

#define _IPC21_USB1IP0_POSITION                  0x00000008
#define _IPC21_USB1IP0_MASK                      0x00000100
#define _IPC21_USB1IP0_LENGTH                    0x00000001

#define _IPC21_USB1IP1_POSITION                  0x00000009
#define _IPC21_USB1IP1_MASK                      0x00000200
#define _IPC21_USB1IP1_LENGTH                    0x00000001

#define _IPC21_USB1IP2_POSITION                  0x0000000A
#define _IPC21_USB1IP2_MASK                      0x00000400
#define _IPC21_USB1IP2_LENGTH                    0x00000001

#define _IPC21_U4ERIP0_POSITION                  0x0000000C
#define _IPC21_U4ERIP0_MASK                      0x00001000
#define _IPC21_U4ERIP0_LENGTH                    0x00000001

#define _IPC21_U4ERIP1_POSITION                  0x0000000D
#define _IPC21_U4ERIP1_MASK                      0x00002000
#define _IPC21_U4ERIP1_LENGTH                    0x00000001

#define _IPC21_U4ERIP2_POSITION                  0x0000000E
#define _IPC21_U4ERIP2_MASK                      0x00004000
#define _IPC21_U4ERIP2_LENGTH                    0x00000001

#define _IPC21_SI2C3P0_POSITION                  0x00000000
#define _IPC21_SI2C3P0_MASK                      0x00000001
#define _IPC21_SI2C3P0_LENGTH                    0x00000001

#define _IPC21_SI2C3P1_POSITION                  0x00000001
#define _IPC21_SI2C3P1_MASK                      0x00000002
#define _IPC21_SI2C3P1_LENGTH                    0x00000001

#define _IPC21_SI2C3P2_POSITION                  0x00000002
#define _IPC21_SI2C3P2_MASK                      0x00000004
#define _IPC21_SI2C3P2_LENGTH                    0x00000001

